# Оператор SELECT включает предложение ORDER BY, которое используется для возврата выбранных строк в заданном порядке.
#
# Предложение GROUP BY построено аналогично предложению ORDER BY и имеет целью подразделение выбранных строк на
# определенные группы, на которых могут быть вызваны агрегатные функции. Предложение HAVING обычно используется
# с GROUP BY и имеет форму, похожую на предложение WHERE, за исключением того, что оно применяется к агрегированным
# функциям, используемым внутри групп.
